{
	"@metadata": {
		"authors": [
			"Lucas Werkmeister"
		]
	},
	"create": "Label for the button to create a new lexeme.",
	"csrf_warning": "A hopefully rare error message; “CSRF” is usually not translated, but the “protection failed” is.",
	"duplicates_warning": "Header of an error message, followed by an HTML list of duplicate lexemes in the interface.",
	"duplicates_instructions": "Footer of an error message, following an HTML list of duplicate lexemes in the interface",
	"no_duplicate": "Label for a checkbox at the bottom of the form.",
	"advanced": "Label for the button at the end of the page pointing to the “advanced” version of the tool.",
	"advanced_general": "Header of notification message, followed by some detailed messages.",
	"advanced_lexeme_id": "Explanation of one feature of “advanced” mode.",
	"advanced_partial_forms": "Explanation of one feature of “advanced” mode.",
	"lexeme_id": "Label for the input field for the ID of a lexeme.",
	"advanced_partial_forms_hint": "Hint displayed when users try to create a lexeme with forms missing while not in “advanced” mode.",
	"generated_via": "Label of an input pre-filled via a URL parameter, when forms were automatically generated.",
	"description_with_forms_and_senses": "Template to augment the description of a lexeme detected as a potential duplicate, if number of forms and senses are available.\n\nParameters:\n* $1 – the original description (e. g. “English noun”)\n* $2 – the number of forms\n* $3 – the number of senses",
	"bulk_link": "The name of a feature to mass-create or -edit lexemes. This message is used for the link on the index page, the button on a regular template page, and the heading on the bulk mode page.",
	"bulk_format_help": "Label of a link to a page explaining the syntax of bulk mode.",
	"bulk_not_allowed": "Error message if non-autoconfirmed users try to use bulk mode.",
	"edit_link": "Label for the button at the end of the page in “edit” mode, where the forms of an existing lexeme are edited.",
	"edit_general": "Notification message explaining “edit” mode.",
	"edit_mismatch_warning": "Warning message displayed when the user opened an “edit” mode URL where the lexeme and template don’t seem to match (e. g. the template is for nouns but the lexeme has lexical category verb).",
	"edit_ambiguous_warning": "Warning message displayed in “edit” mode when some forms of the lexeme are ambiguous between multiple forms of the template (e. g. the template has nominative singular and accusative singular, and the form only has grammatical feature singular).\n\nParameters:\n* $1 – the number of affected forms",
	"edit_unmatched_warning": "Warning message displayed in “edit mode” when some forms of the lexeme don’t match any forms of the template (e. g. the form has no grammatical features).\n\nParameters:\n* $1 – the number of affected forms",
	"edit_form_list_item": "Template to display a lexeme form in the above two messages.\n\nParameters:\n* $1 – the form representation and ID as a link\n* $2 – the list of its grammatical features\n* $3 – the number of its statements",
	"no_grammatical_features": "Text used in place of a list of grammatical features when a form has no grammatical features yet."
}
