{
	"@metadata": {
		"authors": [
			"Ajeje Brazorf",
			"Lucas Werkmeister",
			"Robby",
			"Verdy p"
		]
	},
	"create": "Label for the button to create a new lexeme.\n\n{{Identical|Create}}",
	"csrf-warning": "A hopefully rare error message; “CSRF” is usually not translated, but the “protection failed” is.",
	"duplicates-warning": "Header of an error message, followed by an HTML list of duplicate lexemes in the interface.",
	"duplicates-instructions": "Footer of an error message, following an HTML list of duplicate lexemes in the interface",
	"duplicates-create": "Footer of an error message, folllowing an HTML list of duplicate lexemes in the interface, in bulk mode. (Replaces {{msg-wm|wikidata-lexeme-forms-duplicates-instructions}}.)",
	"no-duplicate": "Label for a checkbox at the bottom of the form.",
	"form-optional": "Label to indicate that a form is optional and can be left out. This is appended directly to the main label of the form (e.g. “singular”, “present participle”), so in most languages it should start with a space, which must be specified as a numeric character reference (<code>&amp;#32</code>).",
	"advanced": "Label for the button at the end of the page pointing to the “advanced” version of the tool.",
	"advanced-general": "Header of notification message, followed by some detailed messages.",
	"advanced-lexeme-id": "Explanation of one feature of “advanced” mode.",
	"advanced-partial-forms": "Explanation of one feature of “advanced” mode.",
	"lexeme-id": "Label for the input field for the ID of a lexeme.",
	"advanced-partial-forms-hint": "Hint displayed when users try to create a lexeme with forms missing while not in “advanced” mode.",
	"generated-via": "Label of an input pre-filled via a URL parameter, when forms were automatically generated.",
	"description-with-forms-and-senses": "Template to augment the description of a lexeme detected as a potential duplicate, if number of forms and senses are available.\n\nParameters:\n* $1 – the original description (e. g. “English noun”)\n* $2 – the number of forms\n* $3 – the number of senses",
	"bulk-link": "The name of a feature to mass-create or -edit lexemes. This message is used for the link on the index page, the button on a regular template page, and the heading on the “bulk” mode page.",
	"bulk-format-help": "Label of a link to a page explaining the syntax of “bulk” mode.",
	"bulk-not-allowed": "Error message if non-autoconfirmed users try to use “bulk” mode.\n\nParameters:\n* $1 – the user to whom the message is addressed. Can be used with the GENDER magic word.",
	"bulk-first-field-not-lexeme-id": "Error message if the input has the right number of fields where the first field should be the ID of an existing lexeme to edit, but the first field does not look like a lexeme ID.\n\nParameters:\n* $1 – the number of forms of the template.\n* $2 – the number of fields in the input (one more than $1).\n* $3 – the first field, which is expected to be a lexeme ID but isn’t.\n* $4 – the line number in the input.",
	"bulk-first-field-lexeme-id": "Error message if the input has the right number of fields where the first field should be a regular form just like the other fields, but the first field looks like a lexeme ID.\n\nParameters:\n* $1 – the number of forms of the template.\n* $2 – the number of fields in the input (equal to $1).\n* $3 – the first field, which looks like a lexeme ID but isn’t expected to.\n* $4 – the line number in the input.",
	"bulk-wrong-number-of-fields": "Error message if the input has the wrong number of fields.\n\nParameters:\n* $1 – the number of forms of the template.\n* $2 – the number of fields in the input (one more than $1).\n* $3 – the line number in the input.",
	"bulk-optional-forms-hint": "Info message if the input has less fields than expected.",
	"edit-link": "Label for the button at the end of the page in “edit” mode, where the forms of an existing lexeme are edited.\n{{identical|Edit}}",
	"edit-general": "Notification message explaining “edit” mode.",
	"edit-mismatch-warning": "Warning message displayed when the user opened an “edit” mode URL where the lexeme and template don’t seem to match (e. g. the template is for nouns but the lexeme has lexical category verb).",
	"edit-ambiguous-warning": "Warning message displayed in “edit” mode when some forms of the lexeme are ambiguous between multiple forms of the template (e. g. the template has nominative singular and accusative singular, and the form only has grammatical feature singular).\n\nParameters:\n* $1 – the number of affected forms",
	"edit-unmatched-warning": "Warning message displayed in “edit” mode when some forms of the lexeme don’t match any forms of the template (e. g. the form has no grammatical features).\n\nParameters:\n* $1 – the number of affected forms",
	"edit-form-list-item": "Template to display a lexeme form in the above two messages.\n\nParameters:\n* $1 – the form representation and ID as a link\n* $2 – the list of its grammatical features\n* $3 – the number of its statements",
	"no-grammatical-features": "Text used in place of a list of grammatical features when a form has no grammatical features yet.",
	"title-create": "Part of the title of the tool when in “create” or “regular” mode.\n\nParameters:\n* $1 – the label of the template",
	"title-advanced": "Part of the title of the tool when in “advanced” mode (compare {{msg-wm|wikidata-lexeme-forms-advanced}}).\n\nParameters:\n* $1 – the label of the template",
	"title-bulk": "Part of the title of the tool when in “bulk” mode (compare {{msg-wm|wikidata-lexeme-forms-bulk-link}}).\n\nParameters:\n* $1 – the label of the template",
	"title-edit": "Part of the title of the tool when in “edit” mode (compare {{msg-wm|wikidata-lexeme-forms-edit-link}}).\n\nParameters:\n* $1 – the label of the template",
	"login-hint": "Message shown to the user when they are not logged in, but are looking at a page that would allow logged-in users to make edits (basically any page other than the index page).\n\nParameters:\n* $1 – the URL for the login link",
	"ambiguous-template": "Message shown to the user when they follow a link to a template that was replaced by several other templates (or “split up” – if the template was renamed to a single other template, the user is redirected with no message). The message is followed by a list of the other templates.\n\nParameters:* $1 – the identifier of the former template.\n* $2 – the number of other templates; can be used with the PLURAL magic word if needed, but is guaranteed to be greater than one, so most languages will not use this (only ones with several plural forms)",
	"settings-label-interface-language-code": "Label for a setting where users can set the interface language code.",
	"settings-label-use-wikifunctions": "Label for a setting where users can click buttons to generate forms based on functions stored in Wikifunctions, which they can then save directly or edit as needed.",
	"settings-save": "Label of the save button on the settings page.\n{{Identical|Save}}",
	"tool-name": "The name of the tool.\n\nNote that the name is intentionally ambiguous: “forms” can refer to the parts of lexemes (as in e.g. {{msg-mw|datatypes-type-wikibase-form}}) or to the interactive page elements (as in e.g. {{msg-mw|forms}}). In languages that don’t use the same word for both, it’s probably better to go for the “parts of lexemes” meaning in the translation.",
	"skip-to-main-content": "Text for a link that allows users of assistive technologies to skip unimportant parts of the page (the navigation section).",
	"documentation": "Text for a link to the tool’s documentation.\n{{Identical|Documentation}}",
	"toolforge": "Text for a link to the tool’s hosting platform, Wikimedia Toolforge.",
	"source-code": "Text for a link to the tool’s source code.",
	"login": "Text for a link to log into the tool.\n{{Identical|Log in}}",
	"settings-link": "Text for a link to the tool’s settings in the navbar. Usually identical to {{msg-wm|Wikidata-lexeme-forms-settings-heading}}.\n{{Identical|Settings}}",
	"settings-heading": "Heading for the settings page. Usually identical to {{msg-wm|Wikidata-lexeme-forms-settings-link}}.\n{{Identical|Settings}}",
	"logged-in": "Indicator in the navbar that the user is logged in.\n\nParameters:\n* $1 – the user name as a link to the user page.\n* $2 – the user name as plain text. Can be used with the GENDER magic word.",
	"requires-javascript": "Message to indicate to the user that a feature is not available if JavaScript is disabled.",
	"wikifunctions-generating": "Message shown after the user has clicked one of the buttons to generate forms using Wikifunctions. The message vanishes as soon as form generation finishes.",
	"wikifunctions-error": "Message shown to the user if generating the forms using Wikifunctions failed for some reason."
}
